dialog-semiconductor/Flash-Universal-Flashloader/mcu/NXP/IMXRT1170-cm7/sdk/fsl_common.h
#define SDK_ATOMIC_LOCAL_TOGGLE(addr, bits) \
        ((1UL == sizeof(*(addr))) ? _SDK_AtomicLocalToggle1Byte((volatile void*)(addr), (bits)) : \
        ((2UL == sizeof(*(addr))) ? _SDK_AtomicLocalToggle2Byte((volatile void*)(addr), (bits)) : \
        _SDK_AtomicLocalToggle4Byte((volatile void*)(addr), (bits))))

#define SDK_ATOMIC_LOCAL_CLEAR_AND_SET(addr, clearBits, setBits) \
        ((1UL == sizeof(*(addr))) ? _SDK_AtomicLocalClearAndSet1Byte((volatile void*)(addr), (clearBits), (setBits)) : \
        ((2UL == sizeof(*(addr))) ? _SDK_AtomicLocalClearAndSet2Byte((volatile void*)(addr), (clearBits), (setBits)) : \
        _SDK_AtomicLocalClearAndSet4Byte((volatile void*)(addr), (clearBits), (setBits))))
#else

#define SDK_ATOMIC_LOCAL_ADD(addr, val)       \
    do {                                      \
        uint32_t s_atomicOldInt;              \
        s_atomicOldInt = DisableGlobalIRQ();  \
        *(addr) += (val);                     \
        EnableGlobalIRQ(s_atomicOldInt);      \
    } while (0)

#define SDK_ATOMIC_LOCAL_SET(addr, bits)      \
    do {                                      \
        uint32_t s_atomicOldInt;              \
        s_atomicOldInt = DisableGlobalIRQ();  \
        *(addr) |= (bits);                    \
        EnableGlobalIRQ(s_atomicOldInt);      \
    } while (0)

#define SDK_ATOMIC_LOCAL_CLEAR(addr, bits)    \
    do {                                      \
        uint32_t s_atomicOldInt;              \
        s_atomicOldInt = DisableGlobalIRQ();  \
        *(addr) &= ~(bits);                   \
        EnableGlobalIRQ(s_atomicOldInt);      \
    } while (0)

#define SDK_ATOMIC_LOCAL_TOGGLE(addr, bits)   \
    do {                                      \
        uint32_t s_atomicOldInt;              \
        s_atomicOldInt = DisableGlobalIRQ();  \
        *(addr) ^= (bits);                    \
        EnableGlobalIRQ(s_atomicOldInt);      \
    } while (0)

#define SDK_ATOMIC_LOCAL_CLEAR_AND_SET(addr, clearBits, setBits) \
    do {                                                         \
        uint32_t s_atomicOldInt;                                 \
        s_atomicOldInt = DisableGlobalIRQ();                     \
        *(addr) = (*(addr) & ~(clearBits)) | (setBits);          \
        EnableGlobalIRQ(s_atomicOldInt);                         \
    } while (0)

#endif
/* @} */

#if defined ( __ARMCC_VERSION ) && ( __ARMCC_VERSION >= 6010050 )
void DefaultISR(void);
#endif
/*
 * The fsl_clock.h is included here because it needs MAKE_VERSION/MAKE_STATUS/status_t
 * defined in previous of this file.
 */
#include "fsl_clock.h"

/*
 * Chip level peripheral reset API, for MCUs that implement peripheral reset control external to a peripheral
 */
#if ((defined(FSL_FEATURE_SOC_SYSCON_COUNT) && (FSL_FEATURE_SOC_SYSCON_COUNT > 0)) || \
     (defined(FSL_FEATURE_SOC_ASYNC_SYSCON_COUNT) && (FSL_FEATURE_SOC_ASYNC_SYSCON_COUNT > 0)))
#include "fsl_reset.h"
#endif

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
        extern "C"
{
#endif

    /*!
     * @brief Enable specific interrupt.
     *
     * Enable LEVEL1 interrupt. For some devices, there might be multiple interrupt
     * levels. For example, there are NVIC and intmux. Here the interrupts connected
     * to NVIC are the LEVEL1 interrupts, because they are routed to the core directly.
     * The interrupts connected to intmux are the LEVEL2 interrupts, they are routed
     * to NVIC first then routed to core.
     *
     * This function only enables the LEVEL1 interrupts. The number of LEVEL1 interrupts
     * is indicated by the feature macro FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS.
     *
     * @param interrupt The IRQ number.
     * @retval kStatus_Success Interrupt enabled successfully
     * @retval kStatus_Fail Failed to enable the interrupt
     */
    static inline status_t EnableIRQ(IRQn_Type interrupt)
    {
        status_t status = kStatus_Success;

        if (NotAvail_IRQn == interrupt)
        {
            status = kStatus_Fail;
        }

#if defined(FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS) && (FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS > 0)
        else if (interrupt >= FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS)
        {
            status = kStatus_Fail;
        }
#endif

        else
        {
#if defined(__GIC_PRIO_BITS)
            GIC_EnableIRQ(interrupt);
#else
            NVIC_EnableIRQ(interrupt);
#endif
        }

        return status;
    }

    /*!
     * @brief Disable specific interrupt.
     *
     * Disable LEVEL1 interrupt. For some devices, there might be multiple interrupt
     * levels. For example, there are NVIC and intmux. Here the interrupts connected
     * to NVIC are the LEVEL1 interrupts, because they are routed to the core directly.
     * The interrupts connected to intmux are the LEVEL2 interrupts, they are routed
     * to NVIC first then routed to core.
     *
     * This function only disables the LEVEL1 interrupts. The number of LEVEL1 interrupts
     * is indicated by the feature macro FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS.
     *
     * @param interrupt The IRQ number.
     * @retval kStatus_Success Interrupt disabled successfully
     * @retval kStatus_Fail Failed to disable the interrupt
     */
    static inline status_t DisableIRQ(IRQn_Type interrupt)
    {
        status_t status = kStatus_Success;

        if (NotAvail_IRQn == interrupt)
        {
            status = kStatus_Fail;
        }

#if defined(FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS) && (FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS > 0)
        else if (interrupt >= FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS)
        {
            status = kStatus_Fail;
        }
#endif

        else
        {
#if defined(__GIC_PRIO_BITS)
            GIC_DisableIRQ(interrupt);
#else
            NVIC_DisableIRQ(interrupt);
#endif
        }

